# InSup6 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..InSup6 Property
SymbolTypeId Class See Also
---
Symbol in⁶, indicating unit Inches to the sixth power.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId InSup6 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InSup6 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InSup6 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace